# Магические методы __str__ и __repr__
# Магический метод - это тот, который начинается и заканчивается двумя подчеркиваниями "__"
# Еще называют dunder методами - совмещенно от "d"ouble и "under"score - dunder
# Они вызываются автоматически внутри класса.
# Например метод __init__ вызывается сразу при создании объекта и отвечает за инициализацию.

class Lion:
    def __init__(self, name):
        self.name = name

    # Методы __str__ и __repr__ отвечают за текстовое отображение объекта в системе
    # Метод __repr__ отвечает за то, как объект будет отображаться внутри нашей системы,
    # т.е. как его будут видеть разработчики
    def __repr__(self):
        return f"The object Lion - {self.name} "

    # Метод __str__ отвечает за то, как объект будет отображён, если к нему применить функиции str
    # или print. Дургими словами - как объект увидет пользователь
    def __str__(self):
        return f"Lion - {self.name}"


# Если метода не объявлены, то льву будут выглядеть вот так:
# <__main__.Lion object at 0x000001B2A0D98C10>
# l1 = Lion("Bob")
# print(l1)

# Чтобы объект отображался в человеческом виде, используются методы __str__ и __repr__
# Если определён метод __repr__, а метода
l1 = Lion("Simba")
print(l1)
