# Магический метод bool
"""
Все объекты в Python имеют тип True.
Если это необходимо изменить, то нужно переопределять метод __bool__
При этом важно помнить, что если метод bool не определён, то Python смотрит в метод len.
Если же нет ни метода bool, ни метода len, то экземпляры всегда будут True.
"""


class Point:
    def __init__(self, x, y):
        self.x = x
        self.y = y

    # """Пока метода bool нет, Python смотрит в метод len.
    # В этом случае у точки нет длины и метод len переопределяется для возвращения модуля разницы
    # между координатами точки"""
    #
    # def __len__(self):
    #     print("Сработал метод len.")
    #     return abs(self.x - self.y)

    # Переопределяем метод bool таким образом, чтобы False была только точка с координатами 0, 0
    def __bool__(self):
        print("Сработал метод bool")
        # Возврат метода bool всегда должен быть или True или False
        # В этом случае возвращается False только в том случае, если оба выражения False
        return self.x != 0 or self.y != 0

    def auto_bool(self):
        if self:
            print("Метод bool вызвался автоматически.")


p1 = Point(1, 2)
print("Теперь при вызове метода bool для объекта автоматически срабатывает метод len.")
print(f"Точка p1 с координатами {p1.x} и {p1.y}: ", bool(p1))
print("Т.е. в этом случае разница между координатами равна 1, а единица - True.")

print()
p2 = Point(1, 1)
print("Если же координаты равны 1 и 1, то разница между ними равна 0 и результат работы метода:")
print(f"Точка p2 с координатами {p2.x} и {p2.y}: ", bool(p2))

print()
p3 = Point(0, 0)
print(f"Точка p3 с координатами {p3.x} и {p3.y}: ", bool(p3))

"""Во всех этих случаях метод bool вызывается явно. Но он может вызываться и автоматически.
В примере ниже определяется объект класса с координатами и он автоматически проверяется на True или False.
Если он True, то вызывается метод класса auto_bool (для примера)"""
print()
p4 = Point(5, 6)
if p4:
    p4.auto_bool()

# Теперь создаётся объект с координатами 0, 0. В этом случае созданный метод bool возвращает False
print()
p5 = Point(0, 0)
if p5:
    p5.auto_bool()
else:
    print("Вернулось значение False")