'''
Необходимо провести синтаксический анализ текста,
сформировать список из уникальных слов 
'''
new = set()
new2 = set()
new3 = set()
print('Обработка первого текста \n')
r = open('text_for_mng.txt', encoding='utf-8')
'''
Применяем метод split, который возвращает список из всех слов.
При этом все пробелы и переносы строки откинуться
'''
# (r.read().split())
'''
В полученном списке слов много тех слов, которые повторяются.
Конвертируем этот список во множество с только уникальными словами
И добавим все эти элементы в наше пустое множество new
'''
new.update(set(r.read().split()))
r.close
print(new)
print('\n')
print('Обработка второго текста \n')
'''
Повторяем обработку, как первого текста
'''
q = open('text_for_mng2.txt', encoding='utf-8')
new2.update(set(q.read().split()))
q.close
print(new2)
print('\n')
'''
После обработок мы получили два списка уникальных слов из двух разных текстов.
С ними можно работать.
Если же второй текст добавить во множество new1, то во множестве new1 останутся
только уникальные слова для обоих текстов
'''
print('Объединение двух текстов и выделение из обоих уникальных слов')
r3 = open('text_for_mng.txt', encoding='utf-8')
new3.update(set(r3.read().split()))
r3.close
q3 = open('text_for_mng2.txt', encoding='utf-8')
new3.update(set(q3.read().split()))
r3.close
print(new3)

