''' Получаем строку текста '''
txt = input()

def words(txt):       
  txt = txt.split()     #разрезаем строку на слова по пробелам (по умолчанию)
  for word in txt:      # делаем цикл for для перебора слов в txt для возвращения генератором этого слова
    yield word          # возвращаем генераторов слово после перебора
print(list(words(txt))) # печатаем полученные результаты после функции, т.е. набор слов, но в виде списка через функцию list

''' Пример еще одного генератора, но уже в одну строку '''
print([i for i in range(11) if i % 2 == 0])
