x = (9, 9, 9, 8, 7, 6, 5, 4, 3)
y = tuple('string')
# q, w, e, r = x # кортеж можно разбить на переменные, но кол-во переменных должно совпадать с количеством элементов кортежа

print(x[0]) #как и в списке, в кортеже к элементам можно обращаться по индексу
print(x)
print(y)
print(x[1:5])

spisok = [9,8,7,6,5,4,3]
for i in range(len(spisok)):
    spisok[i] +=3

print(spisok)

print('Кортеж можно пропускать через список. Для этого копируем имеющийся котреж в новый список')
y = [] #список изначально пустой
for i in range(len(x)):
    y.append(x[i]+3)
print('Новый список выглядит так: ', y)
print('Котреж выглядит так, т.е. остался неизменным: ', x)

t = list(x)
t[0] = 10
x = tuple(t)
print(x)
print(type(x))

print('Методы работы с кортежами')
print('Метод count позволяет подсчитать кол-во элементов в кортеже')
print(x.count(9))
print('Метод index возвращает индекс или порядковый номер элемента в кортеже')
print(x.index(9))
print('Если в кортеже 2 элемента, то выводится индекс первого встречающегося элемента')

h = (1, 2, 3)
print('При условии, что кортеж является неизменяемым типом данных, к нему можно добавить еще один кортеж')
print('Изначально кортеж h выглядит вот так: ', h)
print('Добавляем к кортежу еще один кортеж: 4, 5')
g = h
h += (4, 5)
print('Теперь кортеж выглядит вот так: ', h)
print('При присваивании кортежа второй переменной (g) изменяется только изначальный кортеж, а второй кортеж не именяется')
print('Кортеж H:', h)
print('Кортеж G:', g)
