file = open("names.txt", "w+")

'''
В файл, открытый в режиме w+ можно сразу вносить записи и сразу читать из него записи,
не закрывая его и повторно не открывая
'''

names1 = ('Тестовая строка 1')
print('В круглых скобках () перечень значений имеет тип: ', type(names1))
print('Элементом итерирования СТРОКИ является БУКВА и результат итерации выглядит так:')

for i in names1:
    file.write(i + '\n')
for i in names1:
    print(i)
file.write('\n')
print('')

names2 = ['Тестовая строка 2']
file = open("names.txt", "a")
print('В квадратных скобках [] перечень значений имеет тип: ', type(names2))
print('Элементом итерирования СПИСКА является ВСЁ ПРЕДЛОЖЕНИЕ и результат итерации выглядит так:')
for i in names2:
    file.write(i + '\n')
for i in names2:
    print(i)
file.write('\n')
print('')

names2_1 = ['Тестовая', 'строка 2.1', 'для', 'итерирования', 'при', 'помощи', 'цикла', 'for']
print('Если же в квадратных скобках [] значения записаны в кавычках и через запятую, то перечень значений также имеет тип: ', type(names2_1))
print('Но в этом случае элементом итерирования такого УПОРЯДОЧЕННОГО СПИСКА является СЛОВО и результат итерации выглядит так:')
##file = open("names.txt", "a")
for i in names2_1:
    file.write(i + '\n')
for i in names2_1:
    print(i)
file.write('\n')
print('')

names3 = {'Тестовая строка 3'}
print('В фигурных скобках {} перечень значений имеет тип: ', type(names3))
print('Элементом итерирования МНОЖЕСТВА является ВСЯ СТРОКА и результат итерации выглядит так:')
##file = open("names.txt", "w+")
for i in names3:
    file.write(i + '\n')
for i in names3:
    print(i)
file.write('\n')
print('')

names3_1 = {'Тестовая', 'строка 3_1', 'для', 'итерирования', 'при', 'помощи', 'цикла', 'for'}
print('Если в фигурных скобках {} записаны в кавычках и через запятую, то перечень значений также имеет тип:: ', type(names3_1))
print('Но элементом итерирования такого МНОЖЕСТВА является СЛОВО и результат итерации выглядит КАК НЕУПОРЯДОЧЕННОЕ МНОЖЕСТВО или так:')
for i in names3_1:
    file.write(i + '\n')
for i in names3_1:
    print(i)
file.write('\n')
print('')

names4 = 'Тестовая строка 4'
print('Без каких-либо скобок перечень значений имеет тип: ', type(names4))
print('Элементом итерирования СТРОКИ является БУКВА и результат итерации выглядит так:')
for i in names4:
    file.write(i + '\n')
for i in names4:
    print(i)
file.write('\n')
print('')

file.close()
