"""Инструкции к заданию
10 минут на выполнение
Возьмите данные по вызовам пожарных служб в Москве за 2015-2019 годы:
https://video.ittensive.com/python-advanced/data-5283-2019-10-04.utf.csv
Получите из них фрейм данных (таблицу значений).
По этому фрейму вычислите среднее значение вызовов пожарных машин
в месяц в одном округе Москвы, округлив до целых
Примечание: найдите среднее значение вызовов, без учета года
Вопросы к этому заданию
Какое число среднее число вызовов пожарных в Москве по округам за месяц в 2015-2019 годах?
---
Пример преподавателя
Какое число среднее число вызовов пожарных в Москве по округам за месяц в 2015-2019 годах?
493"""

import pandas as pd

"""Сначала нужно прочитать файл и посмотреть на разделитель данных.
В данном случае это ";" и значит delimiter = \";\""""
data = pd.read_csv("https://video.ittensive.com/python-advanced/data-5283-2019-10-04.utf.csv", delimiter=";",
                   na_values="NA")
"""После этого меняем все значения nan на 0."""
data.fillna(0, axis=1, inplace=True)
"""После этого мы можем определить столбец с нужными нам данными- это Calls"""
print(data.head())
"""По столбцу данных Calls считает среднее значение методом mean
Также нужно округлить до целых: методом int или round()"""
print(int(data["Calls"].mean()))
print(data["Calls"].mean().round())
