import numpy as np
import matplotlib.pyplot as plt

# Загружаем удалённый файл и указываем, что данные в нём разделены запятыми
# Для облегчения переформатирования данных можно использовать параметры:
# - skiprows - пропустить сколько-то строк сначала файла
# - max_rows - говорит, сколько строк нам взять
# В нашем случае мы первую строку пропускаем и берём вторую строку,
# а максимально берём одну строку.
data = np.loadtxt("https://video.ittensive.com/python-advanced/01.mnist.8.txt",
                  delimiter=",", skiprows=1, max_rows=1)
# Выводим, что за форма данных нас ждёт
print(data.shape)
# После этого мы видим, что у нас 3 строки и в каждой 784 значения
# Делаем преобразование данных во второй строке (индекс 1) - изменяем её форму через метод reshape.
# Т.е. строка из 784 чисел приводится к матрице 28 на 28
# data = np.reshape(data[1], (28, 28))
# После того, как конкретно указали строку, которую берём, в методе reshape можно просто указать DataFrame
data = np.reshape(data, (28, 28))
# После этого строим изображение из этих чисел.
# Передаём эти числа в matplotlib и говорим, что они должны быть построены как градации серого.
# Метод imshow строит изображение из данных - из массива numpy
plt.imshow(data, cmap='Greys')
# Отображаем на экране наше изображение
plt.show()